tocache/Microchip-PIC18F4550/UPC Microcontroladores 2019-1/Semana 10/servomonster.X/pantalleitor3.c
/*
 * File:   pantalleitor.c
 * Author: Alumnos
 *
 * Created on 24 de mayo de 2019, 11:00 AM
 */

#pragma config PLLDIV = 1       // PLL Prescaler Selection bits (No prescale (4 MHz oscillator input drives PLL directly))
#pragma config CPUDIV = OSC1_PLL2// System Clock Postscaler Selection bits ([Primary Oscillator Src: /1][96 MHz PLL Src: /2])
#pragma config FOSC = XTPLL_XT  // Oscillator Selection bits (XT oscillator, PLL enabled (XTPLL))
#pragma config PWRT = ON        // Power-up Timer Enable bit (PWRT enabled)
#pragma config BOR = OFF        // Brown-out Reset Enable bits (Brown-out Reset disabled in hardware and software)
#pragma config BORV = 3         // Brown-out Reset Voltage bits (Minimum setting 2.05V)
#pragma config VREGEN = OFF     // USB Voltage Regulator Enable bit (USB voltage regulator disabled)
#pragma config WDT = OFF        // Watchdog Timer Enable bit (WDT disabled (control is placed on the SWDTEN bit))
#pragma config WDTPS = 32768    // Watchdog Timer Postscale Select bits (1:32768)
#pragma config CCP2MX = ON      // CCP2 MUX bit (CCP2 input/output is multiplexed with RC1)
#pragma config PBADEN = OFF     // PORTB A/D Enable bit (PORTB<4:0> pins are configured as digital I/O on Reset)
#pragma config MCLRE = ON       // MCLR Pin Enable bit (MCLR pin enabled; RE3 input pin disabled)
#pragma config LVP = OFF        // Single-Supply ICSP Enable bit (Single-Supply ICSP disabled)

#include <xc.h>
#include "LCD.h"
#include "ADC.h"

#define _XTAL_FREQ 48000000UL

int resultadomon = 0;

int digdmi = 0;
int digmil = 0;
int digcen = 0;
int digdec = 0;
int diguni = 0;
int temporal = 0;
int temporal2 = 0;
int temporal3 = 0;

void DIGITOS(int valor){
    digdmi = valor / 10000;
    temporal3 = valor - (digdmi * 10000);
    digmil = temporal3 / 1000;
    temporal = temporal3 - (digmil * 1000);
    digcen = temporal / 100;
    temporal2 = temporal - (digcen * 100);
    digdec = temporal2 / 10;
    diguni = temporal2 - (digdec * 10);        
}

void main(void) {
    /*Configuracion del LCD usando libreria*/
    TRISD = 0x00;               //Puertos como salida para el LCD
    __delay_ms(500);            //Esperar a que botee el LCD
    LCD_CONFIG();
    __delay_ms(15);
    CURSOR_ONOFF(OFF);
    
//    TRISCbits.RC2 = 0;          //Puerto RC2 como salida (conectado el backlight del LCD)
//    LATCbits.LC2 = 1;           //Encendido el backlight del LCD
    
    /*Configuracion del ADC usando libreria*/
    ADC_CONFIG(0);

    /*Configuracion del CCP1 en PWM*/
    PR2 = 249;                  //Periodo del PWM
    CCPR1L = 50;               //Duty Cycle del PWM 50%
    TRISCbits.RC2 = 0;          //Pin RC2 como salida
    T2CON = 0x05;               //Activamos Timer2 y seteamos el PRESCALER
    CCP1CON = 0x0C;              //Colocamos en modo PWM al CCP1 
    
    while(1){
        /*Seteado del brillo del backlight del LCD*/
        if(PORTBbits.RB0 == 0){
            CCPR1L = 50;               //Duty Cycle del PWM 15% aprox
        }
        else{
            CCPR1L = 200;               //Duty Cycle del PWM 15% aprox            
        }
        
        CURSOR_HOME();
        ESCRIBE_MENSAJE("Leyendo POT:", 11);
        resultadomon = ADC_CONVERTIR();
        DIGITOS(resultadomon);      //Funcion de sacar los digitos de la variable resultadomon
        POS_CURSOR(2,0);            //Cursos a la segunda linea
        ENVIA_CHAR(digdmi+0x30);    //Impresion de resultadomon en el LCD
        ENVIA_CHAR(digmil+0x30);
        ENVIA_CHAR(digcen+0x30);
        ENVIA_CHAR(digdec+0x30);
        ENVIA_CHAR(diguni+0x30);
    }
}
